// цикл for, который повторится 10 раз и выведит в консоль текст "hello, intocode"
for (let i = 0; i < 10; i++) {
  console.log("hello, intocode");
}

// цикл for, который повторится миллион раз
for (let i = 0; i < 1000000; i++) {}

// цикл for, который выведет в консоль числа от 0 до 100
for (let i = 0; i < 100; i++) {
  console.log(i);
}
// цикл for, который выведет в консоль числа от 500 до 1000
for (let i = 500; i < 1000; i++) {
  console.log(i);
}
// цикл for, который выведет в консоль числа от 1000 до 0
for (let i = 1000; i > 0; i--) {
  console.log(i);
}
